# Preprocessing notes

## Basic info
Version: 0.2 (2021-12-11)  
Â© Tiago Tamagusko (tamagusko@uc.pt)<br>
License: [LICENSE](/LICENSE)

In [1]:
import pandas as pd
import numpy as np

# Create a dataframe from dict
data = {
    'cliente': ['Ines','Pedro', 'Joao','Maria'],
    'idade': ['23', '15', '45', np.nan],
    'salario': ['1200', '150', '800', '3000'],
    'totalCompras': ['100', '200', np.nan,  '300'],
    'compraRealizada': ['sim', 'nao', 'talvez',  'sim']
}

df = pd.DataFrame(data, columns = data.keys())
df

  cliente idade salario totalCompras compraRealizada
0    Ines    23    1200          100             sim
1   Pedro    15     150          200             nao
2    Joao    45     800          NaN          talvez
3   Maria   NaN    3000          300             sim

## Encoding values

In [2]:
# One Hot Encoding
df = pd.get_dummies(df, prefix=['compra'], columns=['compraRealizada'])
df

  cliente idade salario totalCompras  compra_nao  compra_sim  compra_talvez
0    Ines    23    1200          100           0           1              0
1   Pedro    15     150          200           1           0              0
2    Joao    45     800          NaN           0           0              1
3   Maria   NaN    3000          300           0           1              0

In [3]:
# Label Encoding
df = pd.DataFrame(data, columns = data.keys())

from sklearn.preprocessing import LabelEncoder
df['compra'] = LabelEncoder().fit_transform(df.compraRealizada)
df

  cliente idade salario totalCompras compraRealizada  compra
0    Ines    23    1200          100             sim       1
1   Pedro    15     150          200             nao       0
2    Joao    45     800          NaN          talvez       2
3   Maria   NaN    3000          300             sim       1

In [4]:
# Ordinal Encoding
df = pd.DataFrame(data, columns = data.keys())

compra_dict = {
    'sim': 1,
    'nao': 0,
    'talvez': 2,
}
df['compra'] = df.compraRealizada.map(compra_dict)
# Can be simplified like this:
# df['compra'] = df.compraRealizada.map(dict(sim=1, nao=0, talvez=2))
df

  cliente idade salario totalCompras compraRealizada  compra
0    Ines    23    1200          100             sim       1
1   Pedro    15     150          200             nao       0
2    Joao    45     800          NaN          talvez       2
3   Maria   NaN    3000          300             sim       1

In [5]:
# Encoding w/ replace
df = pd.DataFrame(data, columns = data.keys())
df['compraRealizada'] = df['compraRealizada'].replace({'sim': 1, 'nao': 0, 'talvez': 2})
df

  cliente idade salario totalCompras  compraRealizada
0    Ines    23    1200          100                1
1   Pedro    15     150          200                0
2    Joao    45     800          NaN                2
3   Maria   NaN    3000          300                1

## Missing values

In [4]:
# Verify na values
df.isna().any()

cliente            False
idade               True
salario            False
totalCompras        True
compraRealizada    False
compra             False
dtype: bool

In [5]:
df['idade'].isnull()

0    False
1    False
2    False
3     True
Name: idade, dtype: bool

In [6]:
df.isnull().sum()

cliente            0
idade              1
salario            0
totalCompras       1
compraRealizada    0
compra             0
dtype: int64

In [9]:
# Drop na rows
df.dropna()

  cliente idade salario totalCompras  compraRealizada
0    Ines    23    1200          100                1
1   Pedro    15     150          200                0

In [7]:
# Fill NA
df = pd.DataFrame(data, columns = data.keys())
df.fillna(0

  cliente idade salario totalCompras compraRealizada
0    Ines    23    1200          100             sim
1   Pedro    15     150          200             nao
2    Joao    45     800            0          talvez
3   Maria     0    3000          300             sim

In [11]:
df

  cliente idade salario totalCompras compraRealizada
0    Ines    23    1200          100             sim
1   Pedro    15     150          200             nao
2    Joao    45     800          NaN          talvez
3   Maria   NaN    3000          300             sim

In [12]:
# https://towardsdatascience.com/how-to-use-python-and-missforest-algorithm-to-impute-missing-data-ed45eb47cb9a